/*
데브코스에 지원하게 된 동기는 무엇인가요?

데스 코스는 순수 자바스크립트에 집중할 수 있는 시간이 6주간이나 주어지는데
많은 궁금증을 해결할 수 있겠다는 확신이 들었습니다.
함수형 프로그래밍, 객체 지향적 프로그래밍을 어떻게 프로젝트에 적용시킬 수 있을지
실무에서 this, bind를 언제 사용할수 있을지 class, prototype중 무엇을 선호하고, 사용하며 제너레이터, 객체 프로퍼티 플래그, 커링, 클로져를 실무에서 어떤 경우 사용하고 있는지
그리고 수많은 자바스크립트의 기능을 사용해서 보편적이도록, 가독성이 좋도록 그리고 효율적이도록 리팩토링 할 수 있을지 얘기해보고 고민해보고 싶었습니다.

데브코스의 팀협업프로젝트 또한 지원하게 된 동기중 하나입니다.
여러 분야의 스테디 셀러들이 모여 협업하며 큰 도메인을 만들어내고 지탱하는 모습이 멋있다고 생각했고,
그런 사람들과 협업하여 무언가 만들어내는 경험을 하고 싶습니다.

개발자가 되고 싶은 이유는 무엇인가요?

개발하는 과정이 재미있고 제가 만든 기능을 누군가 사용하는 걸 보면서 성취감을 크게 느끼기 때문입니다.
이년전 한 회사에서 아르바이트를 했습니다. 그때 주로 했던 일은 반도체 회사에서 제공하는 부품의 매뉴얼을 정리하는 일이였습니다.
이 작업의 로직이 간단하고 반복된다는 걸 알게되었고 효율적으로 바꾸기위해 퇴근 후 파이썬을 공부하여 매크로를 만들어서 사내에 제공하였습니다.
그리고 계속해서 매크로를 발전 시켜 nodejs의 puppeteer라는 라이브러리로 웹 스크레퍼를 만들고
일렉트론으로 매크로와 여러 기능을 추가한 앱을 만들어 사내에 제공하였습니다.
처음에는 무언가 만드는 과정이 너무 재밌었고, 나중에는 내가 만든 기능으로 많은 사람들이 편하게 일할 수 있게 되면서 기뻤고 큰 성취감을 느꼈습니다.
칭찬을 들을 때면 개발자는 마법사같은 존재가 되고
다른 사람이 제가 만든 기능으로 업무 프로세스가 단축되는 것을 볼때면 개발자는 뒤에 숨어서 누군가를 돕는 히어로가 되는 멋진 직업이라고 생각합니다.

프론트엔드 분야로 진출하고자 하는 이유와 어떠 노력을 하셨는지 궁금해요.

프론트엔드는 디자인, 백엔드, 마케팅, 기획과도 연결되어있고 프론트엔드라면 반드시 사용해야하는 자바스크립트 언어 또한 프론트엔드 직군처럼 
플랫폼에 상관없이 웹, 앱 심지어 커피 머신에서도 사용할 수 있다는 점이 닮아있어 매력적인 분야라고 생각합니다.

일을 하면서 개발 공부를 하기 때문에 평일은 퇴근 후 최소 9시까지 강의를 보면서 작은 프로젝트를 만들어보거나 프레임워크, 라이브러리의 사용법을 공부하였고
주말에는 알고리즘, c++, 네트워크 등 cs를 공부했습니다.

데브코스에서 어떻게 학습을 이어갈 계획인가요?

온오프 혼합으로 알고 있습니다.
만약 오프라인으로 진행된다면 
오전 리마인드 후 코어타임을 가질 생각입니다.
코어타임 후 til을 노션이나 깃에 아카이빙하고 코드 리뷰나 피드백을 받을 시간이 있다면 공유하고 싶습니다.

*/
